form/app/Controllers/Home.php

INSERT INTO `submissions` (`type`, `date`, `proofNumber`, `projectCode`, `contractNumber`, `customer`, `recipient`, `category`, `items`, `total`, `attachment`, `submission`, `email`) VALUES ('penerimaan pendapatan', '2023-01-08', 'GS 001/10/2022', 'P001', 'S180243/JOBT/TPD', 'Job Tomori', 'Joko', 'Tunjangan Transport Dan Uang Jalan', '[{\"description\":\"Alat Tulis Kantor\",\"unitRef\":\"ATK Lainya\",\"amount\":2,\"unit\":\"Barang\",\"unitPrice\":200000,\"totalPrice\":400000,\"moreDescription\":\"-\",\"beginningPeriod\":\"2023-01-08\",\"endPeriod\":\"2023-01-08\"},{\"description\":\"Fire Truck\",\"unitRef\":\"FT 01  DN 9954 AW\",\"amount\":12,\"unit\":\"Barang\",\"unitPrice\":200000,\"totalPrice\":2400000,\"moreDescription\":\"Ada\",\"beginningPeriod\":\"2023-01-08\",\"endPeriod\":\"2023-01-08\"}]', 2800000, '', 'GS-001-10-2022', '12@ptbss.com')
---
                if (count($query->getResult()) == 0 || empty($query->getRow()))
                {
                    $data['message'] = 'Document was submited.';
                    $db->table('submissions')->insert([
                        'type'          => $data['type'],
                        'date'          => date('Y-m-d', strtotime($data['document']['date'])),
                        'proofNumber'   => $data['document']['proofNumber'],
                        'projectCode'   => $data['document']['projectCode'],
                        'contractNumber'=> $data['document']['contractNumber'],
                        'customer'      => $data['document']['customerName'],
                        'recipient'     => $data['document']['recipientName'],
                        'category'      => $data['document']['category'],
                        'items'         => json_encode($data['items']),
                        'total'         => $data['total'],
                        'attachment'    => $data['file']['attachments'],
                        'submission'    => $data['file']['submission'],
                        'email'         => $data['email'],
                    ]);